grevaillot/svd_tools/headers/STM32F302/can.h
/** @defgroup can_tsr TSR transmit status register
@{*/

/** CAN_TSR_LOW2 Lowest priority flag for mailbox 2 **/
#define CAN_TSR_LOW2		(1 << 31)
/** CAN_TSR_LOW1 Lowest priority flag for mailbox 1 **/
#define CAN_TSR_LOW1		(1 << 30)
/** CAN_TSR_LOW0 Lowest priority flag for mailbox 0 **/
#define CAN_TSR_LOW0		(1 << 29)
/** CAN_TSR_TME2 Lowest priority flag for mailbox 2 **/
#define CAN_TSR_TME2		(1 << 28)
/** CAN_TSR_TME1 Lowest priority flag for mailbox 1 **/
#define CAN_TSR_TME1		(1 << 27)
/** CAN_TSR_TME0 Lowest priority flag for mailbox 0 **/
#define CAN_TSR_TME0		(1 << 26)

#define CAN_TSR_CODE_SHIFT		24
#define CAN_TSR_CODE_MASK		0x03
/** @defgroup can_tsr_code CODE CODE
@{*/
/**@}*/

/** CAN_TSR_ABRQ2 ABRQ2 **/
#define CAN_TSR_ABRQ2		(1 << 23)
/** CAN_TSR_TERR2 TERR2 **/
#define CAN_TSR_TERR2		(1 << 19)
/** CAN_TSR_ALST2 ALST2 **/
#define CAN_TSR_ALST2		(1 << 18)
/** CAN_TSR_TXOK2 TXOK2 **/
#define CAN_TSR_TXOK2		(1 << 17)
/** CAN_TSR_RQCP2 RQCP2 **/
#define CAN_TSR_RQCP2		(1 << 16)
/** CAN_TSR_ABRQ1 ABRQ1 **/
#define CAN_TSR_ABRQ1		(1 << 15)
/** CAN_TSR_TERR1 TERR1 **/
#define CAN_TSR_TERR1		(1 << 11)
/** CAN_TSR_ALST1 ALST1 **/
#define CAN_TSR_ALST1		(1 << 10)
/** CAN_TSR_TXOK1 TXOK1 **/
#define CAN_TSR_TXOK1		(1 << 9)
/** CAN_TSR_RQCP1 RQCP1 **/
#define CAN_TSR_RQCP1		(1 << 8)
/** CAN_TSR_ABRQ0 ABRQ0 **/
#define CAN_TSR_ABRQ0		(1 << 7)
/** CAN_TSR_TERR0 TERR0 **/
#define CAN_TSR_TERR0		(1 << 3)
/** CAN_TSR_ALST0 ALST0 **/
#define CAN_TSR_ALST0		(1 << 2)
/** CAN_TSR_TXOK0 TXOK0 **/
#define CAN_TSR_TXOK0		(1 << 1)
/** CAN_TSR_RQCP0 RQCP0 **/
#define CAN_TSR_RQCP0		(1 << 0)

/**@}*/

/** @defgroup can_rf0r RF0R receive FIFO 0 register
@{*/

/** CAN_RF0R_RFOM0 RFOM0 **/
#define CAN_RF0R_RFOM0		(1 << 5)
/** CAN_RF0R_FOVR0 FOVR0 **/
#define CAN_RF0R_FOVR0		(1 << 4)
/** CAN_RF0R_FULL0 FULL0 **/
#define CAN_RF0R_FULL0		(1 << 3)

#define CAN_RF0R_FMP0_SHIFT		0
#define CAN_RF0R_FMP0_MASK		0x03
/** @defgroup can_rf0r_fmp0 FMP0 FMP0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_rf1r RF1R receive FIFO 1 register
@{*/

/** CAN_RF1R_RFOM1 RFOM1 **/
#define CAN_RF1R_RFOM1		(1 << 5)
/** CAN_RF1R_FOVR1 FOVR1 **/
#define CAN_RF1R_FOVR1		(1 << 4)
/** CAN_RF1R_FULL1 FULL1 **/
#define CAN_RF1R_FULL1		(1 << 3)

#define CAN_RF1R_FMP1_SHIFT		0
#define CAN_RF1R_FMP1_MASK		0x03
/** @defgroup can_rf1r_fmp1 FMP1 FMP1
@{*/
/**@}*/


/**@}*/

/** @defgroup can_ier IER interrupt enable register
@{*/

/** CAN_IER_SLKIE SLKIE **/
#define CAN_IER_SLKIE		(1 << 17)
/** CAN_IER_WKUIE WKUIE **/
#define CAN_IER_WKUIE		(1 << 16)
/** CAN_IER_ERRIE ERRIE **/
#define CAN_IER_ERRIE		(1 << 15)
/** CAN_IER_LECIE LECIE **/
#define CAN_IER_LECIE		(1 << 11)
/** CAN_IER_BOFIE BOFIE **/
#define CAN_IER_BOFIE		(1 << 10)
/** CAN_IER_EPVIE EPVIE **/
#define CAN_IER_EPVIE		(1 << 9)
/** CAN_IER_EWGIE EWGIE **/
#define CAN_IER_EWGIE		(1 << 8)
/** CAN_IER_FOVIE1 FOVIE1 **/
#define CAN_IER_FOVIE1		(1 << 6)
/** CAN_IER_FFIE1 FFIE1 **/
#define CAN_IER_FFIE1		(1 << 5)
/** CAN_IER_FMPIE1 FMPIE1 **/
#define CAN_IER_FMPIE1		(1 << 4)
/** CAN_IER_FOVIE0 FOVIE0 **/
#define CAN_IER_FOVIE0		(1 << 3)
/** CAN_IER_FFIE0 FFIE0 **/
#define CAN_IER_FFIE0		(1 << 2)
/** CAN_IER_FMPIE0 FMPIE0 **/
#define CAN_IER_FMPIE0		(1 << 1)
/** CAN_IER_TMEIE TMEIE **/
#define CAN_IER_TMEIE		(1 << 0)

/**@}*/

/** @defgroup can_esr ESR error status register
@{*/


#define CAN_ESR_REC_SHIFT		24
#define CAN_ESR_REC_MASK		0xff
/** @defgroup can_esr_rec REC REC
@{*/
/**@}*/


#define CAN_ESR_TEC_SHIFT		16
#define CAN_ESR_TEC_MASK		0xff
/** @defgroup can_esr_tec TEC TEC
@{*/
/**@}*/


#define CAN_ESR_LEC_SHIFT		4
#define CAN_ESR_LEC_MASK		0x07
/** @defgroup can_esr_lec LEC LEC
@{*/
/**@}*/

/** CAN_ESR_BOFF BOFF **/
#define CAN_ESR_BOFF		(1 << 2)
/** CAN_ESR_EPVF EPVF **/
#define CAN_ESR_EPVF		(1 << 1)
/** CAN_ESR_EWGF EWGF **/
#define CAN_ESR_EWGF		(1 << 0)

/**@}*/

/** @defgroup can_btr BTR bit timing register
@{*/

/** CAN_BTR_SILM SILM **/
#define CAN_BTR_SILM		(1 << 31)
/** CAN_BTR_LBKM LBKM **/
#define CAN_BTR_LBKM		(1 << 30)

#define CAN_BTR_SJW_SHIFT		24
#define CAN_BTR_SJW_MASK		0x03
/** @defgroup can_btr_sjw SJW SJW
@{*/
/**@}*/


#define CAN_BTR_TS2_SHIFT		20
#define CAN_BTR_TS2_MASK		0x07
/** @defgroup can_btr_ts2 TS2 TS2
@{*/
/**@}*/


#define CAN_BTR_TS1_SHIFT		16
#define CAN_BTR_TS1_MASK		0x0f
/** @defgroup can_btr_ts1 TS1 TS1
@{*/
/**@}*/


#define CAN_BTR_BRP_SHIFT		0
#define CAN_BTR_BRP_MASK		0x3ff
/** @defgroup can_btr_brp BRP BRP
@{*/
/**@}*/


/**@}*/

/** @defgroup can_ti0r TI0R TX mailbox identifier register
@{*/


#define CAN_TI0R_STID_SHIFT		21
#define CAN_TI0R_STID_MASK		0x7ff
/** @defgroup can_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN_TI0R_EXID_SHIFT		3
#define CAN_TI0R_EXID_MASK		0x3ffff
/** @defgroup can_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN_TI0R_IDE IDE **/
#define CAN_TI0R_IDE		(1 << 2)
/** CAN_TI0R_RTR RTR **/
#define CAN_TI0R_RTR		(1 << 1)
/** CAN_TI0R_TXRQ TXRQ **/
#define CAN_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_tdt0r TDT0R mailbox data length control and time stamp register
@{*/


#define CAN_TDT0R_TIME_SHIFT		16
#define CAN_TDT0R_TIME_MASK		0xffff
/** @defgroup can_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN_TDT0R_TGT TGT **/
#define CAN_TDT0R_TGT		(1 << 8)

#define CAN_TDT0R_DLC_SHIFT		0
#define CAN_TDT0R_DLC_MASK		0x0f
/** @defgroup can_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdl0r TDL0R mailbox data low register
@{*/


#define CAN_TDL0R_DATA3_SHIFT		24
#define CAN_TDL0R_DATA3_MASK		0xff
/** @defgroup can_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_TDL0R_DATA2_SHIFT		16
#define CAN_TDL0R_DATA2_MASK		0xff
/** @defgroup can_tdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_TDL0R_DATA1_SHIFT		8
#define CAN_TDL0R_DATA1_MASK		0xff
/** @defgroup can_tdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_TDL0R_DATA0_SHIFT		0
#define CAN_TDL0R_DATA0_MASK		0xff
/** @defgroup can_tdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_tdh0r TDH0R mailbox data high register
@{*/


#define CAN_TDH0R_DATA7_SHIFT		24
#define CAN_TDH0R_DATA7_MASK		0xff
/** @defgroup can_tdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


